ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_bms.c
/******************************************************************************
* Function Name: Cy_BLE_BMSS_GetCharacteristicDescriptor
***************************************************************************//**
*
*  Gets a characteristic descriptor of a specified characteristic of the service.
*
*  \param connHandle:      The connection handle.
*  \param charIndex:       The index of a service characteristic of type
*                   cy_en_ble_bms_char_index_t.
*  \param descrIndex:      The index of a service characteristic descriptor of type
*                   cy_en_ble_bms_descr_index_t.
*  \param attrSize:        The size of the characteristic descriptor attribute.
*  \param attrValue:      The pointer to the location where characteristic descriptor
*                   value data should be stored.
*
* \return
*  The return value is of type cy_en_ble_api_result_t.
*  * CY_BLE_SUCCESS - The request handled successfully.
*  * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameter failed.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_BMSS_GetCharacteristicDescriptor(cy_stc_ble_conn_handle_t connHandle,
                                                               cy_en_ble_bms_char_index_t charIndex,
                                                               cy_en_ble_bms_descr_index_t descrIndex,
                                                               uint8_t attrSize,
                                                               uint8_t *attrValue)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_SUCCESS;

    if((charIndex >= CY_BLE_BMS_CHAR_COUNT) || (descrIndex >= CY_BLE_BMS_DESCR_COUNT))
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else
    {
        cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
        {
            .handleValuePair.attrHandle = cy_ble_bmsConfigPtr->bmss->charInfo[charIndex].descrHandle[descrIndex],
            .handleValuePair.value.len  = attrSize,
            .handleValuePair.value.val  = attrValue,
            .offset                     = 0u,
            .connHandle                 = connHandle,
            .flags                      = CY_BLE_GATT_DB_LOCALLY_INITIATED
        };
        if(Cy_BLE_GATTS_ReadAttributeValueCCCD(&dbAttrValInfo) != CY_BLE_GATT_ERR_NONE)
        {
            apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
        }
    }

    return(apiResult);
}

/******************************************************************************
* Function Name: Cy_BLE_BMSS_WriteEventHandler
***************************************************************************//**
*
*  Handles a Write Request event. Calls the registered BMS application
*  callback function.
*
* Note: Writing an attribute into GATT DB (if needed) is the user's responsibility
*  after the Authorization Code check in the registered BMS application
*  callback function.
*
*  \param eventParam: The pointer to the data structure specified by the event.
*
* \return
*  cy_en_ble_gatt_err_code_t - A function result state if it succeeded
*  (CY_BLE_GATT_ERR_NONE) or failed with error codes:
*   * CY_BLE_GATT_ERR_OP_CODE_NOT_SUPPORTED
*   * CY_BLE_GATT_ERR_INSUFFICIENT_AUTHORIZATION
*
*
******************************************************************************/
static cy_en_ble_gatt_err_code_t Cy_BLE_BMSS_WriteEventHandler(cy_stc_ble_gatts_write_cmd_req_param_t *eventParam)
{
    cy_stc_ble_bms_char_value_t locCharValue =
    {
        .connHandle    = eventParam->connHandle,
        .gattErrorCode = CY_BLE_GATT_ERR_NONE
    };

    if((Cy_BLE_BMS_ApplCallback != NULL) &&
       (eventParam->handleValPair.attrHandle == cy_ble_bmsConfigPtr->bmss->charInfo[CY_BLE_BMS_BMCP].charHandle))
    {
        locCharValue.gattErrorCode =
            Cy_BLE_GATT_DbCheckPermission(eventParam->handleValPair.attrHandle, &eventParam->connHandle,
                                          CY_BLE_GATT_DB_WRITE | CY_BLE_GATT_DB_PEER_INITIATED);

        if(locCharValue.gattErrorCode == CY_BLE_GATT_ERR_NONE)
        {
            locCharValue.charIndex = CY_BLE_BMS_BMCP;
            locCharValue.value = &eventParam->handleValPair.value;

            Cy_BLE_BMS_ApplCallback((uint32_t)CY_BLE_EVT_BMSS_WRITE_CHAR, &locCharValue);

            if(locCharValue.gattErrorCode == CY_BLE_GATT_ERR_NONE)
            {
                cy_stc_ble_gatts_db_attr_val_info_t dbAttrValInfo =
                {
                    .handleValuePair = eventParam->handleValPair,
                    .connHandle      = eventParam->connHandle,
                    .offset          = 0u,
                    .flags           = CY_BLE_GATT_DB_PEER_INITIATED
                };
                locCharValue.gattErrorCode = Cy_BLE_GATTS_WriteAttributeValueCCCD(&dbAttrValInfo);
                if(locCharValue.gattErrorCode == CY_BLE_GATT_ERR_NONE)
                {
                    CY_BLE_GATT_DB_ATTR_SET_ATTR_GEN_LEN(cy_ble_bmsConfigPtr->bmss->charInfo[CY_BLE_BMS_BMCP].charHandle,
                                                         locCharValue.value->len);
                }
            }
        }

        /* Indicate that the request was handled */
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
    }

    return(locCharValue.gattErrorCode);
}

/******************************************************************************
* Function Name: Cy_BLE_BMSS_PrepareWriteEventHandler
***************************************************************************//**
*
*  Handles a Prepare Write Request event.
*
*  \param cy_stc_ble_gatts_prep_write_req_param_t *eventParam: The pointer to the data that
*                                                  came with a Prepare Write
*                                                  request.
*
******************************************************************************/
static void Cy_BLE_BMSS_PrepareWriteRequestEventHandler(cy_stc_ble_gatts_prep_write_req_param_t *eventParam)
{
    if(eventParam->baseAddr[eventParam->currentPrepWriteReqCount - 1u].handleValuePair.attrHandle ==
       cy_ble_bmsConfigPtr->bmss->charInfo[CY_BLE_BMS_BMCP].charHandle)
    {
        cy_stc_ble_gatt_xchg_mtu_param_t mtuParam = { .connHandle = eventParam->connHandle };
        (void)Cy_BLE_GATT_GetMtuSize(&mtuParam);


