ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_bms.c
        if(((cy_ble_bmsConfigPtr->bmss->charInfo[CY_BLE_BMS_BMCP].descrHandle[CY_BLE_BMS_CEPD] !=
             CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE) &&
            CY_BLE_IS_RELIABLE_WRITE_ENABLED(cy_ble_bmsConfigPtr->bmss->
                                              charInfo[CY_BLE_BMS_BMCP].descrHandle[CY_BLE_BMS_CEPD])) ||
           (CY_BLE_GATT_DB_ATTR_GET_ATTR_GEN_MAX_LEN(cy_ble_bmsConfigPtr->bmss->charInfo[CY_BLE_BMS_BMCP].charHandle) >
            (mtuParam.mtu - CY_BLE_GATT_WRITE_HEADER_LEN)))
        {
            /* The first prepare write event */
        }
        else
        {
            eventParam->gattErrorCode = (uint8_t)CY_BLE_GATT_ERR_ATTRIBUTE_NOT_LONG;
        }


        /* Indicate that the request was handled */
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
    }
}

/******************************************************************************
* Function Name: Cy_BLE_BMSS_ExecuteWriteRequestEventHandler
***************************************************************************//**
*
*  Handles an Execute Write Request event.
*
*  \param cy_stc_ble_gatts_exec_write_req_t *eventParam: The pointer to the data that came
*                                            with a Write request.
*
******************************************************************************/
static void Cy_BLE_BMSS_ExecuteWriteRequestEventHandler(cy_stc_ble_gatts_exec_write_req_t *eventParam)
{
    uint32_t locCount;
    cy_stc_ble_gatt_value_t locGattValue = { .len = 0u, .val = NULL };

    for(locCount = 0u; locCount < eventParam->prepWriteReqCount; locCount++)
    {
        if(eventParam->baseAddr[locCount].handleValuePair.attrHandle ==
           cy_ble_bmsConfigPtr->bmss->charInfo[CY_BLE_BMS_BMCP].charHandle)
        {
            locGattValue.len = eventParam->baseAddr[locCount].offset + eventParam->baseAddr[locCount].
                                handleValuePair.value.len;

            if(locGattValue.val == NULL)
            {
                locGattValue.val = eventParam->baseAddr[locCount].handleValuePair.value.val;
            }
            else if(eventParam->baseAddr[locCount].offset == 0u)
            {
                /* The case when the Client wants to rewrite the value from the start */
                locGattValue.val = eventParam->baseAddr[locCount].handleValuePair.value.val;
            }
            else
            {
                /* Do nothing */
            }
        }
    }

    if((Cy_BLE_BMS_ApplCallback != NULL) && (locGattValue.len != 0u) &&
       (locGattValue.len <= CY_BLE_GATT_DB_ATTR_GET_ATTR_GEN_MAX_LEN(cy_ble_bmsConfigPtr->bmss->charInfo[CY_BLE_BMS_BMCP].
                                                                      charHandle)))
    {
        /* Check the execWriteFlag before executing or cancelling the Write Long operation */
        if(eventParam->execWriteFlag == CY_BLE_GATT_EXECUTE_WRITE_EXEC_FLAG)
        {
            cy_stc_ble_bms_char_value_t locCharValue = { .connHandle = eventParam->connHandle };
            locCharValue.gattErrorCode = CY_BLE_GATT_ERR_NONE;
            locCharValue.value = &locGattValue;

            Cy_BLE_BMS_ApplCallback((uint32_t)CY_BLE_EVT_BMSS_WRITE_CHAR, &locCharValue);

            if(locCharValue.gattErrorCode == CY_BLE_GATT_ERR_NONE)
            {
                CY_BLE_GATT_DB_ATTR_SET_ATTR_GEN_LEN(cy_ble_bmsConfigPtr->bmss->
                                                      charInfo[CY_BLE_BMS_BMCP].charHandle, locGattValue.len);
            }

            eventParam->gattErrorCode = (uint8_t)locCharValue.gattErrorCode;
        }

        /* Indicate that the request was handled */
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
    }
}

#endif /* CY_BLE_BMS_SERVER */

#ifdef CY_BLE_BMS_CLIENT


/******************************************************************************
* Function Name: Cy_BLE_BMSC_GetCharacteristicValue
***************************************************************************//**
*
*  This function is used to read the characteristic value from a Server
*  identified by charIndex.
*
*  \param connHandle: The connection handle.
*  \param charIndex: The index of the Service characteristic.
*
* \return
*  The return value is of type cy_en_ble_api_result_t.
*  * CY_BLE_SUCCESS - The read request was sent successfully.
*  * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameters failed.
*  * CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE - The peer device doesn't have
*                                               the particular characteristic.
*  * CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED - Memory allocation failed.
*  * CY_BLE_ERROR_INVALID_STATE - Connection with the Server is not established.
*  * CY_BLE_ERROR_INVALID_OPERATION - The operation is invalid for this
*                                     characteristic.
*
* \events
*  If execution is successful(return value = CY_BLE_SUCCESS),
*  these events can appear: \n
*   If a BMS service-specific callback is registered
*      (with Cy_BLE_BMS_RegisterAttrCallback):
*  * CY_BLE_EVT_BMSC_READ_CHAR_RESPONSE - if the requested attribute is
*                                successfully written on the peer device,
*                                the details (char index , value, etc.) are
*                                provided with an event parameter structure
*                                of type cy_stc_ble_bms_char_value_t.
*  .
*   Otherwise (if a BMS service-specific callback is not registered):
*  * CY_BLE_EVT_GATTC_READ_RSP - if the requested attribute is
*                                successfully read on the peer device,
*                                the details (handle, value, etc.) are
*                                provided with the event parameters
*                                structure (cy_stc_ble_gattc_read_rsp_param_t).
*  * CY_BLE_EVT_GATTC_ERROR_RSP - if there is trouble with the
*                                requested attribute on the peer device,
*                                the details are provided with the event parameters
*                                structure (cy_stc_ble_gatt_err_param_t).
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_BMSC_GetCharacteristicValue(cy_stc_ble_conn_handle_t connHandle,
                                                          cy_en_ble_bms_char_index_t charIndex)
{
    cy_en_ble_api_result_t apiResult;
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(connHandle);

    /* Check the parameters */
    if(Cy_BLE_GetConnectionState(connHandle) != CY_BLE_CONN_STATE_CLIENT_DISCOVERED)
    {
        apiResult = CY_BLE_ERROR_INVALID_STATE;
    }
    else if((charIndex != CY_BLE_BMS_BMFT) || (discIdx >= CY_BLE_CONFIG_GATTC_COUNT))
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else if(cy_ble_bmsc[discIdx].charInfo[charIndex].valueHandle == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
    {
        apiResult = CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE;
    }
    else if((CY_BLE_CHAR_PROP_READ & cy_ble_bmsc[discIdx].charInfo[charIndex].properties) == 0u)
    {
        apiResult = CY_BLE_ERROR_INVALID_OPERATION;
    }
    else
    {
        cy_stc_ble_gattc_read_req_t readReqParam =
        {
            .attrHandle = cy_ble_bmsc[discIdx].charInfo[CY_BLE_BMS_BMFT].valueHandle,
            .connHandle = connHandle
        };
        apiResult = Cy_BLE_GATTC_ReadCharacteristicValue(&readReqParam);

        if(apiResult == CY_BLE_SUCCESS)
        {
            cy_ble_bmscReqHandle[discIdx] = cy_ble_bmsc[discIdx].charInfo[charIndex].valueHandle;
        }
    }

    return(apiResult);
}


